Revit 2026 API

# StairsUndersideSurfaceStyle Enumeration

---

The style of the underside surface of the run.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum StairsUndersideSurfaceStyle
```
```vb
Public Enumeration StairsUndersideSurfaceStyle
```
```cpp
public enum class StairsUndersideSurfaceStyle
```
```fsharp
type StairsUndersideSurfaceStyle
```

| Member name | Value | Description |
| --- | --- | --- |
| Smooth | 1 | The underside surface of the run is smooth. |
| Stepped | 0 | The underside surface of the run is stepped. |

#### Reference

Autodesk.Revit.DB.Architecture Namespace